droplet/constant/wallFilmRegion/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/wallFilmRegion/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          240;
        startFace       10804;
    }
    wallFilmFace_top
    {
        type            patch;
        nFaces          3600;
        startFace       11044;
    }
    region0_to_wallFilmRegion_wallFilmFace
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          3600;
        startFace       14644;
        sampleMode      nearestPatchFace;
        sampleRegion    region0;
        samplePatch     region0_to_wallFilmRegion_wallFilmFace;
        offsetMode      nonuniform;
        offsets         nonuniform List<vector> 
3600
(
(0 0 0)
(0 0 0)
(0 0 0)
(0 2.775557562e-17 0)
(0 0 0)
(0 0 0)
(0 0 0)
(0 0 0)
...
)
;
    }
    mirrorFace_top
    {
        type            patch;
        nFaces          1822;
        startFace       18244;
    }
    region0_to_wallFilmRegion_mirrorFace
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          1822;
        startFace       20066;
        sampleMode      nearestPatchFace;
        sampleRegion    region0;
        samplePatch     region0_to_wallFilmRegion_mirrorFace;
        offsetMode      nonuniform;
        offsets         nonuniform List<vector> 
1822
(
(1.110223025e-16 1.110223025e-16 5.551115123e-17)
(-1.110223025e-16 -1.665334537e-16 -5.551115123e-17)
(0 0 0)
(-1.110223025e-16 0 -5.551115123e-17)
(0 0 0)
(0 1.110223025e-16 0)
(0 0 0)
(5.551115123e-17 0 5.551115123e-17)
...
)
;
    }
)

// ************************************************************************* //
